#include <yoptac.h>

клево A жЫ
ебанное:
    A() сука апохуй нах
    A(A ясенхуй отжать) сука ебнуть нах
    говнойбать уебать A() сука апохуй нах

ебанное:
    говнойбать куку побазарить(ясенхуй базар отжать) ясенхуй сука нихуя нах
есть нах

клево B батя ебанное A жЫ
ебанное:
    B() сука апохуй нах
    B(B ясенхуй отжать) сука ебнуть нах
    уебать B() силикон сука апохуй нах

ебанное:
    куку побазарить(ясенхуй базар отжать ы) ясенхуй силикон жЫ
        пиздуй базарить нах
        базарить:
        напиздеть(ксива, "%s", ы.выровнятьБазар()) нах
    есть
есть нах

хуйня main() жЫ
    базар приветЙопта сука "Привет, " нах
    приветЙопта.вставитьВОчко("йопта!\n") нах
    гыы семки сука приветЙопта.начатьТрещатьСемки() нах
    потрещим (семки чоблясука приветЙопта.перестатьТрещатьСемки()) жЫ
        напиздеть(ксива, "%c", найтиЛоха семки плюсуюна) нах
    есть

    A нихуясебе ы сука захуярить B() нах
    ы->побазарить("Hello, world!\n") нах
    ебнуть ы нах
есть